{"backend": "theano", "config": [{"config": {"activity_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 360], "dtype": "float32", "bias_regularizer": null, "units": 300, "use_bias": true, "name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "units": 102, "use_bias": true, "name": "dense_2", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "units": 12, "use_bias": true, "name": "dense_3", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "units": 6, "use_bias": true, "name": "dense_4", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "units": 1, "use_bias": true, "name": "dense_5", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_5", "activation": "sigmoid", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.0.4", "class_name": "Sequential"}
